
各位来宾、各位朋友、各界领导： 大家好！
　　今天是我儿子袁成浩和儿媳王慧结婚的大喜日子，承蒙各位的厚爱和光临，使今天的婚庆典礼更增添了不少的喜庆色彩。作为家长，这份欣喜无法用语言来表达。在这神圣喜庆的时刻，我代表我们全家向在百忙之中抽出时间，尤其是远道而来的各位来宾、各位亲朋好友，表示最热烈的欢迎和最衷心的感谢！
	缘分使我儿子袁成浩和儿媳王慧结为夫妻。作为父母，我们见证了他们相识、相知、相恋、相爱的过程，今天他们终于牵手走进了婚姻的殿堂，成为一对让人羡慕的伴侣。作为家长我们感到无比的.欣慰与满足。
　　在这美好温馨的时刻，我对两个孩子表示由衷的祝福，祝福你们白头偕老，永结同心！同时，希望这对新人结婚以后，牢记今天你们对彼此的承诺，牢记各位来宾和朋友们对你们的祝福，牢记父母对你们的无限期望。在今后的生活中，相互理解、相互包容、相互关爱、相互尊敬，让友好、和睦、幸福、甜蜜相伴一生；在工作中互勉互励，共同进步，一生风雨同舟，相濡以沫。同时，也希望你们孝敬双方父母，肩负起为人父、为人母的家庭责任，共享天伦之乐。我们是天底下最平凡的父母，我们的孩子也是天底下最平凡的孩子。因此，我们不奢求太多，只是希望他们在踏上婚姻之路，走向人生新旅途之后，能满怀感恩之心，一路平安幸福，一辈子恩爱相伴。

	另外，我要感谢：我儿子的老师，感谢您长久以来的精心培养，使我的孩子从一个顽童逐渐成为了一个爱学习，懂礼貌，讲团结的好学生。是您教给我的孩子打开知识宝库的金钥匙！是您为他扬起了理想的风帆！他在您温暖陽光的沐浴中充满自信！在您汗水的滋润下，像种子一样发芽长大！衷心谢谢你老师！祝你工作如意、合家安吉！

　　在这里，我还特别感谢我的亲家，他们培养了一个聪慧、漂亮的好女儿;我们也非常庆幸找到了一位贤惠、孝顺的好儿媳，请亲家们放心，我们会把她当成自己的女儿来对待。
	最后我再一次地祝福这对新人生活幸福、互敬互爱，并且衷心祝福来参加我儿子、媳妇婚礼的各位来宾身体健康、家庭幸福！
　　谢谢大家！
